#include <iostream>
using namespace std;
void increment(int &var) { 
    var += 1;
}
void increment(int &var, int value) {
    // var += value; – додає значення змінної value до змінної var.
    var += value;
}
// Функція main є точкою входу в програму. Тут починається виконання програми.
int main(void) {
    // Оголошення змінної var типу int і її ініціалізація нульовим значенням.
    int var = 0;
    // Цикл for, який виконується 10 разів, перебираючи значення змінної i від 0 до 9.
    for (int i = 0; i < 10; i++) {
        // Використовуємо умовний оператор if для перевірки значення i:
        // якщо i непарне (тобто остача від ділення i на 2 не дорівнює 0),
        // то викликається функція increment з одним аргументом.
        if (i % 2)
            // Виклик функції increment, яка збільшує змінну var на 1.
            increment(var);
        else
            // Якщо i парне (тобто i % 2 == 0), викликається перевантажена функція increment,
            // що приймає два аргументи: змінну var та значення i. Таким чином, var збільшується на i.
            increment(var, i);
    }
    
    // Після завершення циклу, виводимо кінцеве значення змінної var.
    // Згідно з умовою задачі, очікуване значення має бути 25.
    cout << var << endl;
    
    // Повертаємо 0 для позначення успішного завершення роботи програми.
    return 0;
}
